app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", ""], ["todo_list_id", 1], ["created_at", "2021-02-16 00:09:38.802962"], ["updated_at", "2021-02-16 00:09:38.802962"]]
---
	def create
		@todo_item = @todo_list.todo_items.create(todo_item_params)

DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]
---
	def destroy
		if @todo_item.destroy

UPDATE "todo_items" SET "updated_at" = ?, "completed_at" = ? WHERE "todo_items"."id" = ?  [["updated_at", "2021-02-09 23:22:16.842335"], ["completed_at", "2021-02-09 23:22:16.842148"], ["id", 13]]
---
	def complete
		@todo_item.update_attribute(:completed_at, Time.now)

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def set_todo_list
		@todo_list = TodoList.find(params[:todo_list_id])

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 1], ["id", 5], ["LIMIT", 1]]
---
	def set_todo_item
		@todo_item = @todo_list.todo_items.find(params[:id])