app/controllers/todo_lists_controller.rb

  def edit
	@todo_list = current_user.todo_lists.find(params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @todo_list = current_user.todo_lists.build(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Todo List #1"], ["description", ""], ["created_at", "2021-02-16 00:09:34.362728"], ["updated_at", "2021-02-16 00:09:34.362728"]]

  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)
---
UPDATE "todo_lists" SET "title" = $1, "updated_at" = $2 WHERE "todo_lists"."id" = $3  [["title", "Todo List | HOME"], ["updated_at", "2021-02-16 00:10:48.211513"], ["id", 3]]

    def set_todo_list
      @todo_list = TodoList.find(params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]